avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/coord/app_security.c
/**
 * @file
 *
 * @brief This module configures the MAC Beacon Security
 *
 * Copyright (c) 2013-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

/*
 * Copyright (c) 2014-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under Atmel's Limited License Agreement --> EULA.txt
 */

/* === INCLUDES ============================================================ */
#ifdef MAC_SECURITY_ZIP
#include <string.h>
#include <inttypes.h>
#include <stdio.h>
#include "conf_board.h"
#include "avr2025_mac.h"
#include "delay.h"
#include "common_sw_timer.h"
#include "sio2host.h"
#include "tal.h"
#include "mac_msg_types.h"
#include <asf.h>
#include "beacon_app.h"
#include "stb_generic.h"
#include "mac_security.h"

/* === MACROS ============================================================== */

/* === GLOBALS ============================================================= */
/** Coordinator IEEE Address */
uint8_t const COORD_IEEE_ADDRESS[]
	= {0x12, 0x34, 0x56, 0x78, 0x12, 0x34, 0x56, 0x00};

/** This array stores all device related information. */
extern associated_device_t device_list[MAX_NUMBER_OF_DEVICES];
/** Stores the number of associated devices. */
extern uint16_t no_of_assoc_devices;

/** Current Channel */
extern uint8_t current_channel;

/** This array stores the current beacon payload. */
extern uint8_t beacon_payload[BEACON_PAYLOAD_LEN];

/** This variable stores the current state of the node. */
extern coord_state_t coord_state;

extern uint8_t current_channel_page;

/*
 * This is implemented as an array of bytes, but actually this is a
 * 128-bit variable. This is the reason why the array needs to be filled
 * in in reverse order than expected.
 */
static const uint8_t default_key[4][16] = {
	{
		0xC0, 0xC1, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7,
		0xC8, 0xC9, 0xCA, 0xCB, 0xCC, 0xCD, 0xCE, 0xCF
	},
	{
		0xC0, 0xC1, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7,
		0xC8, 0xC9, 0xCA, 0xCB, 0xCC, 0xCD, 0xCE, 0xD0
	},
	{
		0xC0, 0xC1, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7,
		0xC8, 0xC9, 0xCA, 0xCB, 0xCC, 0xCD, 0xCE, 0xD1
	},
	{
		0xC0, 0xC1, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7,
		0xC8, 0xC9, 0xCA, 0xCB, 0xCC, 0xCD, 0xCE, 0xCF
	}
};

/* Recently associated device number */
extern uint16_t recent_assoc_dev_no;

/* Default key source for MAC Security */
uint8_t default_key_source[8]
	= {0xFF, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

/* Parameter to check the which mlme set confirm callback will currently using
**/
static uint8_t mlme_set_conf_run_time;
/* === PROTOTYPES ========================================================== */

/* Initialize the security PIB and setting the Security PIB for use by mac
 * security */
static void init_secuity_pib(uint8_t PIBAttribute, uint8_t PIBAttributeIndex);

/* mlme set confirm callback will be used after starting the network */
static void usr_mlme_set_conf_run_time(uint8_t status, uint8_t PIBAttribute,
		uint8_t PIBAttributeIndex);

/* === IMPLEMENTATION ====================================================== */

/** @brief Callback function usr_mlme_set_conf
 *
 *  @param status        Result of requested PIB attribute set operation
 *  @param PIBAttribute  Updated PIB attribute
 *
 */
void usr_mlme_set_conf(uint8_t status, uint8_t PIBAttribute,
		uint8_t PIBAttributeIndex)
{
	if (status != MAC_SUCCESS) {
		/* something went wrong with mlme set request; restart */
		wpan_mlme_reset_req(true);
	} else {
		if (mlme_set_conf_run_time) {
			/* post initialization security pib callback */
			usr_mlme_set_conf_run_time(status, PIBAttribute,
					PIBAttributeIndex);
		} else {
			/* Initialize the mac security PIB before starting the
			 * network */
			init_secuity_pib(PIBAttribute, PIBAttributeIndex);
		}
	}

	/* Keep compiler happy. */
	PIBAttributeIndex = PIBAttributeIndex;
}

/** @brief Initialize the security PIB and set the security parameters
 *
 *  @param PIBAttribute MAC PIB Attribute type
 *  @param PIBAttributeIndex MAC PIB Attribute Index
 *
 */
static void init_secuity_pib(uint8_t PIBAttribute, uint8_t PIBAttributeIndex)
{
	switch (PIBAttribute) {
	case macDefaultKeySource:
	{
		/* Set the no.of security level table  entries */
		uint8_t mac_sec_level_table_entries
			= DEFAULT_MAC_SEC_LVL_TABLE_ENTRIES;

		wpan_mlme_set_req(macSecurityLevelTableEntries,
				NO_PIB_INDEX,
				&mac_sec_level_table_entries);
	}
	break;

	case macSecurityLevelTableEntries:
	{
		/* set type of frames will be encrypted and decrypted */
		uint8_t mac_sec_level_table[4] = {  FRAME_TYPE_BEACON, /*
				                                        *
				                                        *
				                                        *
				                                        *FrameType:
				                                        * Beacon
				                                        **/
						    CMD_FRAME_ID_NA,  /*
				                                       *
				                                       *
				                                       *
				                                       *CommandFrameIdentifier:
				                                       * N/A */
						    SECURITY_05_LEVEL,
						    DEV_OVERRIDE_SEC_MIN /*
				                                          *
				                                          *
				                                          *
				                                          *DeviceOverrideSecurityMinimum:
				                                          * True
				                                          **/
		};

