avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/coord/app_security.c
		wpan_mlme_set_req(macSecurityLevelTable,
				INDEX_1,    /* Index: 1 */
				&mac_sec_level_table);
	}
	break;

	case macSecurityLevelTable:
	{
		if (INDEX_1 == PIBAttributeIndex) {
			/* set type of frames will be encrypted and decrypted */
			uint8_t mac_sec_level_table[4] =
			{       FRAME_TYPE_DATA,              /* FrameType:
					                       * Beacon */
				CMD_FRAME_ID_NA,              /*
					                       *
					                       *
					                       *
					                       *CommandFrameIdentifier:
					                       * N/A */
				SECURITY_05_LEVEL,
				DEV_OVERRIDE_SEC_MIN          /*
					                       *
					                       *
					                       *
					                       *DeviceOverrideSecurityMinimum:
					                       * True */
			};
			wpan_mlme_set_req(macSecurityLevelTable,
					INDEX_0, /* Index: 0 */
					&mac_sec_level_table);
		} else if (INDEX_0 == PIBAttributeIndex) {
			/* set the maximum no.of mac key table entries */
			uint8_t mac_key_table_entries
				= DEFAULT_MAC_KEY_TABLE_ENTRIES;

			wpan_mlme_set_req(macKeyTableEntries,
					NO_PIB_INDEX,
					&mac_key_table_entries);
		}
	}
	break;

	case macKeyTableEntries:
	{
		/* set the maximum no.of device table entries */
		uint16_t coord_key_index = DEFAULT_MAC_DEV_TABLE_ENTRIES;
		wpan_mlme_set_req(macDeviceTableEntries,
				NO_PIB_INDEX,
				&coord_key_index);
	}
	break;

	case macDeviceTableEntries:
	{
		/* set the default mac key table values */
		uint8_t mac_key_table[43] = {
			default_key_source[0], /* LookupData[0] */
			default_key_source[1], /* LookupData[1] */
			default_key_source[2], /* LookupData[2] */
			default_key_source[3], /* LookupData[3] */
			default_key_source[4], /* LookupData[4] */
			default_key_source[5], /* LookupData[5] */
			default_key_source[6], /* LookupData[6] */
			default_key_source[7], /* LookupData[7] */
			KEY_INDEX_0,       /* LookupData[8] */
			LOOKUP_DATA_SIZE_1, /* LookupDataSize: 0x01 : Size 9
				             * octets */
			MAC_ZIP_MAX_KEY_ID_LOOKUP_LIST_ENTRIES, /*
				                                 *
				                                 *
				                                 *
				                                 *KeyIdLookupListEntries
				                                 * = 1 */
			/* KeyDeviceList[1] */
			DEV_DESC_HANDLE_IDX_0,       /* DeviceDescriptorHandle
				                     **/
			true,          /* UniqueDevice */
			false,          /* Blacklisted */
			DEV_DESC_HANDLE_IDX_0,       /* DeviceDescriptorHandle
				                     **/
			true,          /* UniqueDevice */
			false,          /* Blacklisted */
			DEV_DESC_HANDLE_IDX_0,       /* DeviceDescriptorHandle
				                     **/
			true,          /* UniqueDevice */
			false,          /* Blacklisted */
			DEV_DESC_HANDLE_IDX_0,                   /*
				                                  *
				                                  *
				                                  *
				                                  *DeviceDescriptorHandle
				                                  **/
			true,          /* UniqueDevice */
			false,          /* Blacklisted */
			MAC_ZIP_MAX_KEY_DEV_LIST_ENTRIES, /*
				                           *
				                           *
				                           *
				                           *KeyDeviceListEntries
				                           **/
			/*  KeyUsageList */
			FRAME_TYPE_BEACON, /* FrameType - Beacon frames */
			CMD_FRAME_ID_NA, /* CommandFrameIdentifier not used in
				          * ZIP */
			MAC_ZIP_MAX_KEY_USAGE_LIST_ENTRIES, /*
				                             *
				                             *
				                             *
				                             *KeyUsageListEntries
				                             **/
			/* Key */
			default_key[3][0],
			default_key[3][1],
			default_key[3][2],
			default_key[3][3],
			default_key[3][4],
			default_key[3][5],
			default_key[3][6],
			default_key[3][7],
			default_key[3][8],
			default_key[3][9],
			default_key[3][10],
			default_key[3][11],
			default_key[3][12],
			default_key[3][13],
			default_key[3][14],
			default_key[3][15],
		};
		wpan_mlme_set_req(macKeyTable,
				INDEX_3, /* Index: 3 */
				&mac_key_table);
	}
	break;

	case macKeyTable:
	{
		/* set the default mac key table values */
		switch (PIBAttributeIndex) {
		case INDEX_3:
		{
			uint8_t mac_key_table1[43] = {
				/* KeyIdLookupList[1].LookupData :
				 * macDefaultKeySource || g_Sec_KeyIndex_1 */
				default_key_source[0],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[0]
						                                **/
				default_key_source[1],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[1]
						                                **/
				default_key_source[2],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[2]
						                                **/
				default_key_source[3],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[3]
						                                **/
				default_key_source[4],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[4]
						                                **/
				default_key_source[5],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[5]
						                                **/
				default_key_source[6],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[6]
						                                **/
				default_key_source[7],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[7]
						                                **/
				KEY_INDEX_1,                                   /*
						                                *
						                                *
						                                *
						                                *LookupData[8]
						                                **/
				LOOKUP_DATA_SIZE_1,                         /*
						                             *
						                             *
						                             *
						                             *LookupDataSize:
						                             *
						                             *
						                             *
						                             *0x01
						                             * :
						                             *
						                             *
						                             *
						                             *Size
						                             * 9
						                             *
						                             *
						                             *
						                             *octets
						                             **/
				MAC_ZIP_MAX_KEY_ID_LOOKUP_LIST_ENTRIES,                         /*
						                                                 *
						                                                 *
						                                                 *
						                                                 *KeyIdLookupListEntries
						                                                 *
						                                                 *=
						                                                 *
						                                                 *
						                                                 *
						                                                 *1
						                                                 **/
				/* KeyDeviceList[1] */
				EMPTY_DEV_HANDLE,                                   /*
						                                     *
						                                     *
						                                     *
						                                     *DeviceDescriptorHandle
						                                     **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *UniqueDevice
						                             **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *Blacklisted
						                             **/
				EMPTY_DEV_HANDLE,                                   /*
						                                     *
						                                     *
						                                     *
						                                     *DeviceDescriptorHandle
						                                     **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *UniqueDevice
						                             **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *Blacklisted
						                             **/
				EMPTY_DEV_HANDLE,                                   /*
						                                     *
						                                     *
						                                     *
						                                     *DeviceDescriptorHandle
						                                     **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *UniqueDevice
						                             **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *Blacklisted
						                             **/
				EMPTY_DEV_HANDLE,                                   /*
						                                     *
						                                     *
						                                     *
						                                     *DeviceDescriptorHandle
						                                     **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *UniqueDevice
						                             **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *Blacklisted
						                             **/
				MAC_ZIP_MAX_KEY_DEV_LIST_ENTRIES,                         /*
						                                           *
						                                           *
						                                           *
						                                           *KeyDeviceListEntries
						                                           **/
				/*  KeyUsageList */
				FRAME_TYPE_DATA,                            /*
						                             *
						                             *
						                             *
						                             *FrameType
						                             * -
						                             *
						                             *
						                             *
						                             *Data
						                             *
						                             *
						                             *
						                             *frames
						                             **/
				CMD_FRAME_ID_NA,                            /*
						                             *
						                             *
						                             *
						                             *CommandFrameIdentifier
						                             *
						                             *
						                             *
						                             *not
						                             *
						                             *
						                             *
						                             *used
						                             *
						                             *
						                             *
						                             *in
						                             *
						                             *
						                             *
						                             *ZIP
						                             **/
				MAC_ZIP_MAX_KEY_USAGE_LIST_ENTRIES,                         /*
						                                             *
						                                             *
						                                             *
						                                             *KeyUsageListEntries
						                                             **/
				/* Key */
				default_key[0][0],
				default_key[0][1],
				default_key[0][2],
				default_key[0][3],
				default_key[0][4],
				default_key[0][5],
				default_key[0][6],
				default_key[0][7],
				default_key[0][8],
				default_key[0][9],
				default_key[0][10],
				default_key[0][11],
				default_key[0][12],
				default_key[0][13],
				default_key[0][14],
				default_key[0][15],
			};
			wpan_mlme_set_req(macKeyTable,
					INDEX_0,            /* Index: 0 */
					&mac_key_table1);
		}
		break;

