avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/coord/app_security.c
		case INDEX_0:
		{
			uint8_t mac_key_table2[43] = {
				/* KeyIdLookupList[1].LookupData :
				 * macDefaultKeySource || g_Sec_KeyIndex_1 */
				default_key_source[0],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[0]
						                                **/
				default_key_source[1],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[1]
						                                **/
				default_key_source[2],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[2]
						                                **/
				default_key_source[3],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[3]
						                                **/
				default_key_source[4],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[4]
						                                **/
				default_key_source[5],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[5]
						                                **/
				default_key_source[6],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[6]
						                                **/
				default_key_source[7],                         /*
						                                *
						                                *
						                                *
						                                *LookupData[7]
						                                **/
				KEY_INDEX_2,                                   /*
						                                *
						                                *
						                                *
						                                *LookupData[8]
						                                **/
				LOOKUP_DATA_SIZE_1,                         /*
						                             *
						                             *
						                             *
						                             *LookupDataSize:
						                             *
						                             *
						                             *
						                             *0x01
						                             * :
						                             *
						                             *
						                             *
						                             *Size
						                             * 9
						                             *
						                             *
						                             *
						                             *octets
						                             **/
				MAC_ZIP_MAX_KEY_ID_LOOKUP_LIST_ENTRIES,                         /*
						                                                 *
						                                                 *
						                                                 *
						                                                 *KeyIdLookupListEntries
						                                                 *
						                                                 *=
						                                                 *
						                                                 *
						                                                 *
						                                                 *1
						                                                 **/
				/* KeyDeviceList[1] */
				EMPTY_DEV_HANDLE,                         /*
						                           *
						                           *
						                           *
						                           *DeviceDescriptorHandle
						                           **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *UniqueDevice
						                             **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *Blacklisted
						                             **/
				EMPTY_DEV_HANDLE,                         /*
						                           *
						                           *
						                           *
						                           *DeviceDescriptorHandle
						                           **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *UniqueDevice
						                             **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *Blacklisted
						                             **/
				EMPTY_DEV_HANDLE,                         /*
						                           *
						                           *
						                           *
						                           *DeviceDescriptorHandle
						                           **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *UniqueDevice
						                             **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *Blacklisted
						                             **/
				EMPTY_DEV_HANDLE,                                   /*
						                                     *
						                                     *
						                                     *
						                                     *DeviceDescriptorHandle
						                                     **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *UniqueDevice
						                             **/
				false,                                      /*
						                             *
						                             *
						                             *
						                             *Blacklisted
						                             **/
				MAC_ZIP_MAX_KEY_DEV_LIST_ENTRIES,                         /*
						                                           *
						                                           *
						                                           *
						                                           *KeyDeviceListEntries
						                                           **/
				/*  KeyUsageList */
				FRAME_TYPE_DATA,                            /*
						                             *
						                             *
						                             *
						                             *FrameType
						                             * -
						                             *
						                             *
						                             *
						                             *Data
						                             *
						                             *
						                             *
						                             *frames
						                             **/
				CMD_FRAME_ID_NA,                            /*
						                             *
						                             *
						                             *
						                             *CommandFrameIdentifier
						                             *
						                             *
						                             *
						                             *not
						                             *
						                             *
						                             *
						                             *used
						                             *
						                             *
						                             *
						                             *in
						                             *
						                             *
						                             *
						                             *ZIP
						                             **/
				MAC_ZIP_MAX_KEY_USAGE_LIST_ENTRIES,                         /*
						                                             *
						                                             *
						                                             *
						                                             *KeyUsageListEntries
						                                             **/
				/* Key */
				default_key[1][0],
				default_key[1][1],
				default_key[1][2],
				default_key[1][3],
				default_key[1][4],
				default_key[1][5],
				default_key[1][6],
				default_key[1][7],
				default_key[1][8],
				default_key[1][9],
				default_key[1][10],
				default_key[1][11],
				default_key[1][12],
				default_key[1][13],
				default_key[1][14],
				default_key[1][15],
			};

