avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/coord/app_security.c
	case macDeviceTable:
	{
		/* Set the PAN Coordinator Extended Address */
		uint8_t pan_coord_add[8];
		pan_coord_add[0] = COORD_IEEE_ADDRESS[7];
		pan_coord_add[1] = COORD_IEEE_ADDRESS[6];
		pan_coord_add[2] = COORD_IEEE_ADDRESS[5];
		pan_coord_add[3] = COORD_IEEE_ADDRESS[4];
		pan_coord_add[4] = COORD_IEEE_ADDRESS[3];
		pan_coord_add[5] = COORD_IEEE_ADDRESS[2];
		pan_coord_add[6] = COORD_IEEE_ADDRESS[1];
		pan_coord_add[7] = COORD_IEEE_ADDRESS[0];

		wpan_mlme_set_req(macPANCoordExtendedAddress,
				NO_PIB_INDEX,                                                    /*
			                                                                          *
			                                                                          *
			                                                                          *
			                                                                          *Index
			                                                                          **/
				pan_coord_add);
	}
	break;

	case macPANCoordExtendedAddress:
	{
		/* Set the PAN Coordinator IEEE Address */
		uint8_t pan_coord_add[8];
		pan_coord_add[0] = COORD_IEEE_ADDRESS[7];
		pan_coord_add[1] = COORD_IEEE_ADDRESS[6];
		pan_coord_add[2] = COORD_IEEE_ADDRESS[5];
		pan_coord_add[3] = COORD_IEEE_ADDRESS[4];
		pan_coord_add[4] = COORD_IEEE_ADDRESS[3];
		pan_coord_add[5] = COORD_IEEE_ADDRESS[2];
		pan_coord_add[6] = COORD_IEEE_ADDRESS[1];
		pan_coord_add[7] = COORD_IEEE_ADDRESS[0];

		wpan_mlme_set_req(macIeeeAddress,
				NO_PIB_INDEX, /* Index */
				pan_coord_add);
	}
	break;

	case macIeeeAddress:
	{
		/* Set the PAN Coordinator Short Address */
		uint16_t short_add = COORD_SHORT_ADDR;
		wpan_mlme_set_req(macPANCoordShortAddress,
				NO_PIB_INDEX,                                                    /*
			                                                                          *
			                                                                          *
			                                                                          *
			                                                                          *Index
			                                                                          **/
				&short_add);
	}
	break;

	case macPANCoordShortAddress:
	{
		/* Set the PAN Coordinator Short Address */
		uint8_t short_addr[2];

		short_addr[0] = (uint8_t)COORD_SHORT_ADDR;          /* low byte
			                                            **/
		short_addr[1] = (uint8_t)(COORD_SHORT_ADDR >> 8);         /*
			                                                   *
			                                                   *
			                                                   *
			                                                   *high
			                                                   *
			                                                   *
			                                                   *
			                                                   *byte
			                                                   **/

		wpan_mlme_set_req(macShortAddress,
				NO_PIB_INDEX,
				short_addr);
		mlme_set_conf_run_time = true;
	}
	break;

	default:
		break;
	}
}

/*
 * @brief Callback function usr_mlme_set_conf will be used after starting the
 * network
 *
 * @param status        Result of requested PIB attribute set operation
 * @param PIBAttribute  Updated PIB attribute
 *
 */
static void usr_mlme_set_conf_run_time(uint8_t status, uint8_t PIBAttribute,
		uint8_t PIBAttributeIndex)
{
	if (status != MAC_SUCCESS) {
		/* something went wrong at mlme set request; restart */
		wpan_mlme_reset_req(true);
	} else {
		switch (PIBAttribute) {
		case macShortAddress:
		{
			/* set the mac association permission */
			uint8_t association_permit = true;

			wpan_mlme_set_req(macAssociationPermit, NO_PIB_INDEX,
					&association_permit);
		}
		break;

		case macAssociationPermit:
		{
			/* Set the MAC Rx on when Idle */
			bool rx_on_when_idle = true;

			wpan_mlme_set_req(macRxOnWhenIdle, NO_PIB_INDEX,
					&rx_on_when_idle);
		}
		break;

		case macRxOnWhenIdle:
		{
			/* Set the beacon payload length. */
			uint8_t beacon_payload_len = BEACON_PAYLOAD_LEN;
			wpan_mlme_set_req(macBeaconPayloadLength, NO_PIB_INDEX,
					&beacon_payload_len);
		}
		break;

		case macBeaconPayloadLength:
		{
			/*
			 * Once the length of the beacon payload has been
			 * defined,
			 * set the actual beacon payload.
			 */
			wpan_mlme_set_req(macBeaconPayload, NO_PIB_INDEX,
					&beacon_payload);
		}
		break;

		case macBeaconPayload:
		{
			if (COORD_STARTING == coord_state) {
				/*
				 * Initiate an active scan over all channels to
				 * determine
				 * which channel to use.
				 * Use: bool wpan_mlme_scan_req(uint8_t
				 * ScanType,
				 *                              uint32_t
				 * ScanChannels,
				 *                              uint8_t
				 * ScanDuration,
				 *                              uint8_t
				 * ChannelPage);
				 *
				 * This request leads to a scan confirm message
				 *->
				 * usr_mlme_scan_conf
				 * Scan for about 50 ms on each channel ->
				 * ScanDuration
				 *= 1
				 * Scan for about 1/2 second on each channel ->
				 * ScanDuration = 5
				 * Scan for about 1 second on each channel ->
				 * ScanDuration = 6
				 */
				wpan_mlme_scan_req(MLME_SCAN_TYPE_ACTIVE,
						SCAN_CHANNEL(current_channel),
						SCAN_DURATION_COORDINATOR,
						current_channel_page);
			}
		}
		break;

		case macDefaultKeySource:
		{
			/* set the maximum no.of mac security level table
			 * entries */
			uint8_t mac_sec_level_table_entries
				= DEFAULT_MAC_SEC_LVL_TABLE_ENTRIES;

			wpan_mlme_set_req(macSecurityLevelTableEntries,
					NO_PIB_INDEX,
					&mac_sec_level_table_entries);
		}
		break;

		case macSecurityLevelTableEntries:
		{
			/* set the mac security level table for the MAC Data
			 * Security */
			uint8_t mac_sec_level_table[4] = {FRAME_TYPE_DATA,  /*
					                                     *
					                                     *
					                                     *
					                                     *FrameType:
					                                     *
					                                     *
					                                     *
					                                     *Data
					                                     **/
							  CMD_FRAME_ID_NA,  /*
					                                     *
					                                     *
					                                     *
					                                     *CommandFrameIdentifier:
					                                     *
					                                     *
					                                     *
					                                     *N/A
					                                     **/

				                          /* ZIP_SEC_MIN,
				                           *          //
				                           * SecurityMinimum: 5
				                           **/
							  0X05,
							  DEV_OVERRIDE_SEC_MIN /*
					                                        *
					                                        *
					                                        *
					                                        *DeviceOverrideSecurityMinimum:
					                                        *
					                                        *
					                                        *
					                                        *True
					                                        **/
			};

