avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/coord/app_security.c
			/*
			 * Setting of PIB attributes will continue once a device
			 * has associated successful.
			 */
			break;

		case macDeviceTableEntries:
		{
			/* MAC Device Table entries for the recently associated
			 * device */
			static uint8_t Temp = 0;
			uint8_t mac_dev_table[17];

			/* Temp is used to not update the already device table
			 * again */
			for (uint16_t i = Temp; i < no_of_assoc_devices; i++) {
				mac_dev_table[0]
					= (uint8_t)(DEFAULT_PAN_ID &
						0x00FF);
				mac_dev_table[1]
					= (uint8_t)(DEFAULT_PAN_ID >>
						8);
				mac_dev_table[2]
					= (uint8_t)device_list[i].short_addr;
				mac_dev_table[3]
					= (uint8_t)(device_list[i].short_addr
						>> 8);
				mac_dev_table[4]
					= (uint8_t)device_list[i].ieee_addr;
				mac_dev_table[5]
					= (uint8_t)(device_list[i].ieee_addr
						>> 8);
				mac_dev_table[6]
					= (uint8_t)(device_list[i].ieee_addr
						>> 16);
				mac_dev_table[7]
					= (uint8_t)(device_list[i].ieee_addr
						>> 24);
				mac_dev_table[8]
					= (uint8_t)(device_list[i].ieee_addr
						>> 32);
				mac_dev_table[9]
					= (uint8_t)(device_list[i].ieee_addr
						>> 40);
				mac_dev_table[10]
					= (uint8_t)(device_list[i].ieee_addr
						>> 48);
				mac_dev_table[11]
					= (uint8_t)(device_list[i].ieee_addr
						>> 56);
				mac_dev_table[12] = 0;      /* Initial Frame
					                     * counter value */
				mac_dev_table[13] = 0;
				mac_dev_table[14] = 0;
				mac_dev_table[15] = 0;
				mac_dev_table[16] = 0;      /* Exempt */

				wpan_mlme_set_req(macDeviceTable,
						i, /* Index */
						&mac_dev_table);
			}
			Temp++;
		}
		break;

		case macDeviceTable:
		{
			/* Use DSN start value as in ZIP test spec. */
			uint8_t new_dsn = 0x0;

			wpan_mlme_set_req(macDSN,
					NO_PIB_INDEX,
					&new_dsn);
		}
		break;

		case macDSN:
		{
			/* Use DSN start value as in ZIP test spec. */
			uint32_t frame_counter = 1;

			wpan_mlme_set_req(macFrameCounter,
					NO_PIB_INDEX,
					&frame_counter);
		}
		break;

		case macFrameCounter:
			break;

		default:
			/* undesired PIB attribute set request; restart */
			wpan_mlme_reset_req(true);
			break;
		}
	}

	/* Keep compiler happy. */
	PIBAttributeIndex = PIBAttributeIndex;
}

#endif
